In [2]:
#Import Library
import pandas as pd

In [3]:
df = pd.DataFrame([[10,20],[20,30],[40,50],[50,48]])
df.columns = ['A', 'B'] 
df

    A   B
0  10  20
1  20  30
2  40  50
3  50  48

In [4]:
#remove duplication rows
df.drop_duplicates()

    A   B
0  10  20
1  20  30
2  40  50
3  50  48

In [5]:
#remove duplicate rows based on the specific columns
df = pd.DataFrame([[10,20],[20,30],[40,50],[50,48]])
df.columns = ['A', 'B'] 
df

    A   B
0  10  20
1  20  30
2  40  50
3  50  48

In [6]:
df.drop_duplicates('B')

    A   B
0  10  20
1  20  30
2  40  50
3  50  48